app/Models/Msuser.php

    function getOne($id = '')
    {
        $x = $this->builder->select('us.userid, us.usercode, us.fullname, us.email, us.password, us.phonenumber, us.role, k.kampusid, k.kampusname, p.prodiid, p.prodiname, p.prodicode, us.jeniskelamin')
            ->join('mskampus k', 'k.kampusid=us.kampusid', 'left')
            ->join('msprodi p', 'p.prodiid=us.prodiid', 'left');
        if ($id != '') {
            $x->where('us.userid', $id);
        }
        return $x->get()->getRowArray();
---
SELECT `us`.`userid`, `us`.`usercode`, `us`.`fullname`, `us`.`email`, `us`.`password`, `us`.`phonenumber`, `us`.`role`, `k`.`kampusid`, `k`.`kampusname`, `p`.`prodiid`, `p`.`prodiname`, `us`.`jeniskelamin`
FROM `msuser` `us`
LEFT JOIN `mskampus` `k` ON `k`.`kampusid`=`us`.`kampusid`
LEFT JOIN `msprodi` `p` ON `p`.`prodiid`=`us`.`prodiid`
WHERE `us`.`userid` = '1'

    function checkEmailLogin($email, $page)
    {
        return $this->builder->where('email', $email)
            ->where('role', $page)
            ->limit(1)->get()->getRowArray();
---
SELECT *
FROM `msuser` `us`
WHERE `email` = 'dosen@gmail.com'
AND `role` = 'dospem'
 LIMIT 1